microCNC/GRBL_ARM/include/TM4C123/startup_TM4C123.c
/*
  startup_TM4C123.c - Startup file for TM4C123 Microcontrollers
  Part of Grbl
  
  Copyright (c) 2014 Rob Brown

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <stdint.h>
#include <stdlib.h>

/*----------Macro definition--------------------------------------------------*/
#define WEAK __attribute__ ((weak))

/*----------Declaration of the default fault handlers-------------------------*/
/* System exception vector handler */
__attribute__ ((used))
void WEAK  Reset_Handler(void);
void WEAK  NMI_Handler(void);
void WEAK  HardFault_Handler(void);
void WEAK  MemManage_Handler(void);
void WEAK  BusFault_Handler(void);
void WEAK  UsageFault_Handler(void);
void WEAK  SVC_Handler(void);
void WEAK  DebugMon_Handler(void);
void WEAK  PendSV_Handler(void);
void WEAK  SysTick_Handler(void);
void WEAK  GPIOPortA_IRQHandler(void);
void WEAK  GPIOPortB_IRQHandler(void);
void WEAK  GPIOPortC_IRQHandler(void);
void WEAK  GPIOPortD_IRQHandler(void);
void WEAK  GPIOPortE_IRQHandler(void);
void WEAK  UART0_IRQHandler(void);
void WEAK  UART1_IRQHandler(void);
void WEAK  SSI0_IRQHandler(void);
void WEAK  I2C0_IRQHandler(void);
void WEAK  PWMFault_IRQHandler(void);
void WEAK  PWMGen0_IRQHandler(void);
void WEAK  PWMGen1_IRQHandler(void);
void WEAK  PWMGen2_IRQHandler(void);
void WEAK  QEI0_IRQHandler(void);
void WEAK  ADCSeq0_IRQHandler(void);
void WEAK  ADCSeq1_IRQHandler(void);
void WEAK  ADCSeq2_IRQHandler(void);
void WEAK  ADCSeq3_IRQHandler(void);
void WEAK  Watchdog_IRQHandler(void);
void WEAK  Timer0A_IRQHandler(void);
void WEAK  Timer0B_IRQHandler(void);
void WEAK  Timer1A_IRQHandler(void);
void WEAK  Timer1B_IRQHandler(void);
void WEAK  Timer2A_IRQHandler(void);
void WEAK  Timer2B_IRQHandler(void);
void WEAK  Comp0_IRQHandler(void);
void WEAK  Comp1_IRQHandler(void);
void WEAK  Comp2_IRQHandler(void);
void WEAK  SysCtrl_IRQHandler(void);
void WEAK  FlashCtrl_IRQHandler(void);
void WEAK  GPIOPortF_IRQHandler(void);
void WEAK  GPIOPortG_IRQHandler(void);
void WEAK  GPIOPortH_IRQHandler(void);
void WEAK  UART2_IRQHandler(void);
void WEAK  SSI1_IRQHandler(void);
void WEAK  Timer3A_IRQHandler(void);
void WEAK  Timer3B_IRQHandler(void);
void WEAK  I2C1_IRQHandler(void);
void WEAK  QEI1_IRQHandler(void);
void WEAK  CAN0_IRQHandler(void);
void WEAK  CAN1_IRQHandler(void);
void WEAK  CAN2_IRQHandler(void);
void WEAK  Hibernate_IRQHandler(void);
void WEAK  USB0_IRQHandler(void);
void WEAK  PWMGen3_IRQHandler(void);
void WEAK  uDMA_IRQHandler(void);
void WEAK  uDMAErr_IRQHandler(void);
void WEAK  ADC1Seq0_IRQHandler(void);
void WEAK  ADC1Seq1_IRQHandler(void);
void WEAK  ADC1Seq2_IRQHandler(void);
void WEAK  ADC1Seq3_IRQHandler(void);
void WEAK  GPIOPortJ_IRQHandler(void);
void WEAK  GPIOPortK_IRQHandler(void);
void WEAK  GPIOPortL_IRQHandler(void);
void WEAK  SSI2_IRQHandler(void);
void WEAK  SSI3_IRQHandler(void);
void WEAK  UART3_IRQHandler(void);
void WEAK  UART4_IRQHandler(void);
void WEAK  UART5_IRQHandler(void);
void WEAK  UART6_IRQHandler(void);
void WEAK  UART7_IRQHandler(void);
void WEAK  I2C2_IRQHandler(void);
void WEAK  I2C3_IRQHandler(void);
void WEAK  Timer4A_IRQHandler(void);
void WEAK  Timer4B_IRQHandler(void);
void WEAK  Timer5A_IRQHandler(void);
void WEAK  Timer5B_IRQHandler(void);
void WEAK  WTimer0A_IRQHandler(void);
void WEAK  WTimer0B_IRQHandler(void);
void WEAK  WTimer1A_IRQHandler(void);
void WEAK  WTimer1B_IRQHandler(void);
void WEAK  WTimer2A_IRQHandler(void);
void WEAK  WTimer2B_IRQHandler(void);
void WEAK  WTimer3A_IRQHandler(void);
void WEAK  WTimer3B_IRQHandler(void);
void WEAK  WTimer4A_IRQHandler(void);
void WEAK  WTimer4B_IRQHandler(void);
void WEAK  WTimer5A_IRQHandler(void);
void WEAK  WTimer5B_IRQHandler(void);
void WEAK  FPU_IRQHandler(void);
void WEAK  PECI0_IRQHandler(void);
void WEAK  LPC0_IRQHandler(void);
void WEAK  I2C4_IRQHandler(void);
void WEAK  I2C5_IRQHandler(void);
void WEAK  GPIOPortM_IRQHandler(void);
void WEAK  GPIOPortN_IRQHandler(void);
void WEAK  QEI2_IRQHandler(void);
void WEAK  Fan0_IRQHandler(void);
void WEAK  GPIOPortP0_IRQHandler(void);
void WEAK  GPIOPortP1_IRQHandler(void);
void WEAK  GPIOPortP2_IRQHandler(void);
void WEAK  GPIOPortP3_IRQHandler(void);
void WEAK  GPIOPortP4_IRQHandler(void);
void WEAK  GPIOPortP5_IRQHandler(void);
void WEAK  GPIOPortP6_IRQHandler(void);
void WEAK  GPIOPortP7_IRQHandler(void);
void WEAK  GPIOPortQ0_IRQHandler(void);
void WEAK  GPIOPortQ1_IRQHandler(void);
void WEAK  GPIOPortQ2_IRQHandler(void);
void WEAK  GPIOPortQ3_IRQHandler(void);
void WEAK  GPIOPortQ4_IRQHandler(void);
void WEAK  GPIOPortQ5_IRQHandler(void);
void WEAK  GPIOPortQ6_IRQHandler(void);
void WEAK  GPIOPortQ7_IRQHandler(void);
void WEAK  GPIOPortR_IRQHandler(void);
void WEAK  GPIOPortS_IRQHandler(void);
void WEAK  PWM1Gen0_IRQHandler(void);
void WEAK  PWM1Gen1_IRQHandler(void);
void WEAK  PWM1Gen2_IRQHandler(void);
void WEAK  PWM1Gen3_IRQHandler(void);
void WEAK  PWM1Fault_IRQHandler(void);


/*----------Symbols defined in linker script----------------------------------*/
extern unsigned long __text_end__;      /*!< End address for the .data section       */
extern unsigned long __data_start__;    /*!< Start address for the .data section     */
extern unsigned long __data_end__;      /*!< End address for the .data section       */
extern unsigned long __bss_start__;     /*!< Start address for the .bss section      */
extern unsigned long __bss_end__;       /*!< End address for the .bss section        */
extern unsigned long __stack_top__;     /*!< Top address for the .stack section      */
extern void _eram;                      /*!< End address for ram                     */

